Autodesk.Revit.DB.WorksetPreview.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WorksetPreview.IsDefaultWorkset
Whether the workset is the default one.
Since:
2014

Autodesk.Revit.DB.WorksetPreview.Owner
User name of the workset.
Since:
2014

Autodesk.Revit.DB.WorksetPreview.Name
Name of the workset.
Remarks:
Name is case-insensitive.
Since:
2014

Autodesk.Revit.DB.WorksetPreview.UniqueId
UniqueId of the workset.
Remarks:
Stable identifier for a workset, UniqueId will not change while synchronizing with central.
Since:
2014

Autodesk.Revit.DB.WorksetPreview.Id
Id of the workset.
Remarks:
Id of the workset may be changed while synchronizing with central. Please use UniqueId to reliably identify worksets despite changes which occur due to synchronization with central.
Since:
2014

Autodesk.Revit.DB.WorksetPreview
Represents an accessor for workset data which can be obtained from an unopened document.
Remarks:
As a base class of Workset, this class has limited access to data.  WorksetPreviews are obtained from
WorksharingUtils.GetUserWorksetInfo() from an unopened document.
Since:
2014